bigjosh/Move38-Arduino-Platform/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

blink.name=Blink

blink.upload.tool=avrdude

# IMPORTANT: Do not put a protocol here. 
# If the protocol is `null` then Arduino will fall back and use 
# whatever programmer is selected in Tools->Programmer

# This is the maximum size of a program image. It comes from 
# Used for printing the "Sketch uses... of program storage space..." message and for moving the program image from base 0x000 "active" game area up to the "built-in" game area. 
# Obnoxiously, the `obj-size` command seems to only be able to take decimal, so 5888=0x1700
# Must match the `FLASH_GAME_IMAGE_SIZE` in the linker file. 
blink.upload.maximum_size=5888
blink.upload.maximum_data_size=1024
blink.upload.speed=115200

blink.bootloader.tool=avrdude
blink.bootloader.low_fuses=0xFF
blink.bootloader.high_fuses=0xDE
blink.bootloader.extended_fuses=0xf8

# Note that the folder `bootloaders` seems to be hardcoded into the Arduino IDE

blink.bootloader.file=BlinkBIOS-ATmega168PB.hex

blink.build.mcu=atmega168pb
blink.build.f_cpu=8000000L
blink.build.board=AVR_BLINK_168
blink.build.core=blinklib
blink.build.variant=standard

##############################################################

blink328.name=Blink328

blink328.upload.tool=avrdude

# IMPORTANT: Do not put a protocol here. 
# If the protocol is `null` then Arduino will fall back and use 
# whatever programmer is selected in Tools->Programmer


# This is the maximum size of a program image. It comes from 
# Used for printing the "Sketch uses... of program storage space..." message and for moving the program image from base 0x000 "active" game area up to the "built-in" game area. 
# Must match the `FLASH_GAME_IMAGE_SIZE` in the linker file. 
# Obnoxiously, the `obj-size` command seems to only be able to take decimal, so 12288=0x3000
blink328.upload.maximum_size=12288
blink328.upload.maximum_data_size=2048
blink328.upload.speed=115200

#blink328.bootloader.tool=avrdude
#blink328.bootloader.low_fuses=0xFF
#blink328.bootloader.high_fuses=0xDE
#blink328.bootloader.extended_fuses=0xf8
#blink328.bootloader.unlock_bits=0x3F
#blink328.bootloader.lock_bits=0x0F

# Note that the folder `bootloaders` seems to be hardcoded into the Arduino IDE

blink328.bootloader.file=BlinkBIOS-ATmega328PB.hex

blink328.build.mcu=atmega328
blink328.build.f_cpu=8000000L
blink328.build.board=AVR_BLINK_328
blink328.build.core=blinklib
blink328.build.variant=standard

##############################################################

